xiawow/open-silklegguitar/firmware/sdkconfig.defaults
# 丝腿吉他 sdkconfig 预设 —— 按逆向结果推定
# 目标芯片: ESP32 (经典蓝牙 A2DP 仅经典款支持, ESP32-S/C 系列无经典蓝牙)
CONFIG_IDF_TARGET="esp32"

# 蓝牙双模: BLE GATT(0x9578 服务) + 经典蓝牙(A2DP Source 连音箱)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y

# 固件横幅 (前端 _8272 从 _710.bin 里解析的就是这一行, 保持原样!)
#   "Dashichang silk leg guita(version: 2.0) starting..."
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
